# =============================================================================
# Brewfile — auto-generated by `dot sync`
# =============================================================================
# Machine is authoritative for package inventory (see CLAUDE.md).
# `dot sync` runs `brew bundle dump --force --describe`, then applies a
# denylist to drop packages that must not bootstrap on fresh machines.
#
# Denylist lives in home/bin/executable_dot (BREWFILE_DENYLIST_*):
#   - 1password, 1password-cli (cask): preflight prerequisites per SETUP.md
#   - elco + elc-online/tap:           private SSH tap; manual post-bootstrap
#   - expressvpn (cask):               flaky LaunchDaemon install; manual
# Manual-install recipes live in docs/KNOWN_ISSUES.md.
#
# Apply:   dot apply            # chezmoi apply + brew bundle install/cleanup
# Capture: dot sync             # this file gets overwritten, flat-alphabetized
# =============================================================================

tap "alltuner/tap"
tap "encoredev/tap"
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "olets/tap"
tap "shopify/shopify"
# Simple, modern, secure file encryption
brew "age"
# Extract annotations from audio signals
brew "aubio"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Gatsby command-line interface
brew "gatsby-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# CLI for Heroku
brew "heroku"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Create beautiful image of your source code
brew "silicon"
# Cross-shell prompt for astronauts
brew "starship"
# SMTP command-line test tool
brew "swaks"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# General purpose fuzzy finder TUI
brew "television"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Your CLI home video recorder
brew "vhs"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Zsh plugin manager
brew "zimfw"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# The static analysis-powered Go framework for building backend applications
brew "encoredev/tap/encore"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Auto-expanding abbreviations manager for zsh. Version 6.x
brew "olets/tap/zsh-abbr@6"
# Zsh plugin to add zsh-abbr's abbreviations to zsh-autosuggestions' suggestions
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"
# A CLI tool to build for the Shopify platform
brew "shopify/shopify/shopify-cli"
# Password manager that keeps all passwords secure behind one password
# Command-line interface for 1Password
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Chromium based browser
cask "arc"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Display management tool
cask "betterdisplay"
# Virtual Audio Driver
cask "blackhole-2ch"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Excalidraw client
cask "excalidrawz"
# VPN client for secure and private internet access
# AI-powered development workspace for macOS
cask "alltuner/tap/factoryfloor"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# AI-powered notepad for meetings
cask "granola"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# App that enables mouse-free UI interaction
cask "shortcat"
# Team communication and collaboration software
cask "slack"
# Control your Sonos system
cask "sonos"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# To-do list
cask "todoist-app"
# Run commands and display their output on the desktop
cask "ubersicht"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Color Picker", id: 1545870783
mas "Home Assistant", id: 1099568401
mas "HP Smart", id: 1474276998
mas "NEEWER Control Center", id: 1664344174
mas "NetSpot", id: 514951692
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Recipe Keeper", id: 1315583175
mas "Speedtest", id: 1153157709
mas "Starry Sky Stacker", id: 1332533290
mas "StarryLandscapeStacker", id: 550326617
mas "Windows App", id: 1295203466
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "elixir-tools.elixir-tools"
vscode "esbenp.prettier-vscode"
vscode "j-f1.sf-symbols"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "parallelsdesktop.parallels-desktop"
vscode "tamasfe.even-better-toml"
