# =============================================================================
# Brewfile — Jarod Taylor's macOS dotfiles
# =============================================================================
# Managed by chezmoi + `dots sync`.
#
# Apply:   brew bundle --file=$(chezmoi source-path)/home/Brewfile --cleanup
# Capture: dots sync   (runs `brew bundle dump --force --describe` + commits)
#
# Auto-generated by `brew bundle dump` on sync; comments may be overwritten.
# Keep this file alphabetized within each group for diff-friendliness.

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "alltuner/tap"                  # factoryfloor
tap "felixkratz/formulae"           # sketchybar, borders
# NOTE: elco is tapped from a private repo (elc-online/homebrew-tap) which
# needs SSH auth. Not in the bootstrap Brewfile because the SSH env isn't
# fully wired during chezmoi apply. Install manually post-bootstrap:
#   brew tap elc-online/tap git@github.com:elc-online/homebrew-tap.git
#   brew install elc-online/tap/elco
tap "nikitabobko/tap"               # aerospace window manager
tap "olets/tap"                     # zsh-abbr, zsh-autosuggestions-abbreviations-strategy

# -----------------------------------------------------------------------------
# Core CLI tooling
# -----------------------------------------------------------------------------
brew "age"                          # file encryption (chezmoi secrets)
brew "bat"
brew "chezmoi"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "jq"
brew "mise"
brew "ripgrep"
brew "starship"
brew "tlrc"
brew "tmux"
brew "tree"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh"

# -----------------------------------------------------------------------------
# Shell (zsh) framework + plugins
# -----------------------------------------------------------------------------
brew "zimfw"                                                      # zsh plugin manager
brew "olets/tap/zsh-abbr@6"                                       # abbreviations
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"       # autosuggestions ↔ abbr

# -----------------------------------------------------------------------------
# Dev languages / toolchains (macOS brews; mise handles app-level language versions)
# -----------------------------------------------------------------------------
brew "cmake"                        # build dep for many tools
brew "luarocks"                     # lua modules (neovim)
brew "pnpm"
brew "ruby-build"
brew "rustup"                       # rustup manages rust toolchains
brew "tree-sitter"                  # parser generator (nvim + CLI)

# -----------------------------------------------------------------------------
# Data / DB
# -----------------------------------------------------------------------------
brew "pgcli"
brew "postgresql@15"
brew "redis"

# -----------------------------------------------------------------------------
# Linting / formatting
# -----------------------------------------------------------------------------
brew "biome"
brew "diff-so-fancy"
brew "shellcheck"

# -----------------------------------------------------------------------------
# TUI / productivity
# -----------------------------------------------------------------------------
brew "btop"                         # system monitor
brew "chafa"                        # image-to-ansi
brew "cmatrix"                      # eye candy
brew "fastfetch"                    # system info
brew "lazygit"
brew "nowplaying-cli"
brew "switchaudio-osx"
brew "television"                   # fuzzy picker
brew "d2"                           # diagrams
brew "mas"                          # mac app store CLI

# -----------------------------------------------------------------------------
# Editor
# -----------------------------------------------------------------------------
brew "neovim"

# -----------------------------------------------------------------------------
# Status bar / window mgmt
# -----------------------------------------------------------------------------
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"

# -----------------------------------------------------------------------------
# Networking
# -----------------------------------------------------------------------------
brew "heroku"
brew "nmap"
brew "swaks"                        # SMTP test tool

# -----------------------------------------------------------------------------
# System integration
# -----------------------------------------------------------------------------
brew "pam-reattach"                 # Touch ID for sudo under tmux
brew "pinentry-mac"                 # GPG pinentry
brew "pipx"                         # isolated Python CLIs

# -----------------------------------------------------------------------------
# Media / archival
# -----------------------------------------------------------------------------
brew "poppler"                      # PDF tools (yazi preview)
brew "portaudio"
brew "sevenzip"
brew "silicon"                      # code-to-image
brew "vhs"                          # terminal recording → gif
brew "yt-dlp"                       # video downloader

# -----------------------------------------------------------------------------
# Web / frontend frameworks (infrequent, kept for project ramp-up speed)
# -----------------------------------------------------------------------------
brew "gatsby-cli"

# -----------------------------------------------------------------------------
# Casks — productivity
# -----------------------------------------------------------------------------
cask "1password"
cask "1password-cli"
cask "cleanshot"
cask "granola"
cask "notion"
cask "obsidian"
cask "raindropio"
cask "raycast"
cask "todoist-app"                  # newer Todoist cask (replaces `todoist`)

# -----------------------------------------------------------------------------
# Casks — browsers
# -----------------------------------------------------------------------------
cask "arc"
cask "firefox@developer-edition"
cask "google-chrome"

# -----------------------------------------------------------------------------
# Casks — development
# -----------------------------------------------------------------------------
cask "beekeeper-studio"
cask "cursor"
cask "dash"
cask "docker-desktop"               # GUI + daemon + docker CLI
cask "github"
cask "postman"
cask "visual-studio-code"

# -----------------------------------------------------------------------------
# Casks — AI tooling
# -----------------------------------------------------------------------------
cask "chatgpt"
cask "claude"

# -----------------------------------------------------------------------------
# Casks — communication
# -----------------------------------------------------------------------------
cask "discord"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "slack"
cask "telegram"
cask "zoom"

# -----------------------------------------------------------------------------
# Casks — media
# -----------------------------------------------------------------------------
cask "adobe-creative-cloud"
cask "excalidrawz"
cask "sonos"
cask "spotify"

# -----------------------------------------------------------------------------
# Casks — system / utilities
# -----------------------------------------------------------------------------
cask "nikitabobko/tap/aerospace"    # tiling window manager
cask "betterdisplay"                # external-display management
cask "blackhole-2ch"                # virtual audio device
cask "expressvpn"
cask "alltuner/tap/factoryfloor"
cask "karabiner-elements"
cask "keycastr"
cask "shortcat"                     # keyboard-driven UI nav
cask "ubersicht"                    # desktop widgets
cask "utm"                          # VMs

# -----------------------------------------------------------------------------
# Casks — terminal
# -----------------------------------------------------------------------------
cask "ghostty"                      # primary terminal

# -----------------------------------------------------------------------------
# Casks — fonts
# -----------------------------------------------------------------------------
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
cask "sf-symbols"
