# =============================================================================
# Brewfile — hand-edited, single source of truth
# =============================================================================
# `dots apply` (via `brew bundle`) reconciles the machine to this file.
# Add `brew "foo"` / `cask "foo"` lines here by hand — `dots sync` does NOT
# touch this file. Friction is the feature: intentional curation, no sprawl.
#
# Deliberate exclusions (install by hand — see docs/KNOWN_ISSUES.md):
#   - 1password + 1password-cli: install preflight from 1password.com before
#     running bootstrap. NOT installed via brew to avoid duplicate `op`
#     binaries and ensure the CLI-integration grant attaches cleanly.
#   - elco + elc-online/tap: private GitHub tap; needs SSH auth that
#     isn't wired during bootstrap. Manual post-bootstrap install.
#
# Layout:
#   1. Taps
#   2. Core CLI (brews)
#   3. Casks — UI
#   4. Mac App Store
#   5. Casks — Interactive installers (LAST; prompt-heavy; grouped so macOS
#      Authorization Services prompts arrive back-to-back instead of
#      scattering across the install)
# =============================================================================


# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "olets/tap"


# -----------------------------------------------------------------------------
# Core CLI (brews)
# -----------------------------------------------------------------------------
# Simple, modern, secure file encryption
brew "age"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Console Matrix
brew "cmatrix"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Gatsby command-line interface
brew "gatsby-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# CLI for Heroku
brew "heroku"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform library for audio I/O
brew "portaudio"
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install various Ruby versions and implementations
brew "ruby-build"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# SMTP command-line test tool
brew "swaks"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# General purpose fuzzy finder TUI
brew "television"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Zsh plugin manager
brew "zimfw"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"

# Tap-qualified brews
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Auto-expanding abbreviations manager for zsh. Version 6.x
brew "olets/tap/zsh-abbr@6"
# Zsh plugin to add zsh-abbr's abbreviations to zsh-autosuggestions' suggestions
brew "olets/tap/zsh-autosuggestions-abbreviations-strategy"


# -----------------------------------------------------------------------------
# Casks — UI
# -----------------------------------------------------------------------------
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Screen capturing tool
cask "cleanshot"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox@developer-edition"
# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-sans"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# AI-powered notepad for meetings
cask "granola"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# App that enables mouse-free UI interaction
cask "shortcat"
# Music streaming service
cask "spotify"
# Messaging app with a focus on speed and security
cask "telegram"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"

# Tap-qualified casks
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"


# -----------------------------------------------------------------------------
# Mac App Store
# -----------------------------------------------------------------------------
mas "Amphetamine", id: 937984704
mas "Color Picker", id: 1545870783
mas "Home Assistant", id: 1099568401
mas "Microsoft Outlook", id: 985367838
mas "NEEWER Control Center", id: 1664344174
mas "Recipe Keeper", id: 1315583175
mas "Slack for Desktop", id: 803453959
mas "Windows App", id: 1295203466


# -----------------------------------------------------------------------------
# Casks — Interactive installers (MUST stay last)
# -----------------------------------------------------------------------------
# These fire Authorization Services / sudo / installer-gui prompts that can't
# be suppressed. Grouped last so prompts arrive back-to-back in one burst
# instead of scattering across the install.
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Virtual Audio Driver
cask "blackhole-2ch"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Keyboard customiser
cask "karabiner-elements"
# Provides updates to various Microsoft products (needed by microsoft-teams;
# microsoft-outlook migrated to MAS — see MAS section above)
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place (no MAS version)
cask "microsoft-teams"
# Video communication and virtual meeting platform
cask "zoom"
